package _21_Class.OOP;

public class OOP {
    public static void main(String[] args) {
        //OOP => Object Oriented Programing
        //객체 지향 프로그래밍
        // - 현실 세계의 개념을 코드로 표현
        // - 사람, 동물, 자동차 하나의 객체로 보는 것
        // - 상태(속성)과 동작(기능)을 중심으로 프로그래밍
        //클래스는 설계 도면, 그 설계 도면으로 만들어낸 것이 객체, 만들 때 사용되는 것이 속성

        //OOP의 원칙
        //1. 추상화: 복잡한 내부 동작은 감추고, 꼭 필요한 기능만 보여주는 것
        //자동차를 예를 들면, 자동차가 시동이 걸리는 과정, 엔진이 돌아가는 과정을 다 감추고
        //그냥 시동이 걸리고 엔진이 돌아간다는 것을 확인시켜줌

        //2. 캡슐화: 정보 은닉

        //3. 상속
        //4. 다형성

        //접근 제어자
        //public: 어디서든 접근 가능, 다른 클래스에서 접근 가능
        //default: 같은 패키지 안에서만 접근 가능 (명시를 따로 하지 않으면 설정 됨)
        //protected: 같은 패키지 또는 자식 클래스에서만 접근 가능
        //private: 해당 클래스 내부에서만 접근 가능 -> 정보 은닉을 위해 사용

    }
}
